App/Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Name>Клиент</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>Ресторан</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>АдресДоставки</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>250</v8:Length>
					</v8:StringQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ДатаСоздания</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>Статус</Name>
				<Type>
					<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>Курьер</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ПлановоеВремяДоставки</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ФактическоеВремяДоставки</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>ВремяДоставкиМинут</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>5</v8:Digits>
						<v8:FractionDigits>0</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Attribute>
			<Attribute>
				<Name>СуммаДокумента</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Name>Блюдо</Name>
						<Type>
							<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
						</Type>
					</Attribute>
					<Attribute>
						<Name>Количество</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>10</v8:Digits>
								<v8:FractionDigits>3</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Attribute>
					<Attribute>
						<Name>Цена</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>15</v8:Digits>
								<v8:FractionDigits>2</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Attribute>
					<Attribute>
						<Name>Сумма</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>15</v8:Digits>
								<v8:FractionDigits>2</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

App/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданКурьеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

App/Enums/СтатусыКурьеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКурьеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНаСмене</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

App/Documents/Заказ/Ext/ObjectModule.bsl
Перем мПредыдущийКурьер;

// Модуль объекта документа Заказ.
// Отвечает за расчет сумм, проверку состава, расчет времени доставки
// и синхронизацию статусов курьеров с заказами.

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ДатаСоздания;
	КонецЕсли;

	мПредыдущийКурьер = ПолучитьКурьераИзБазы();

	ПересчитатьСуммы();
	ПроверитьСостав(Отказ);
	ПроверитьКурьера(Отказ);
	ПроверитьМинимальнуюСумму();
	ЗаполнитьФактическоеВремяДоставки();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	УстановитьПривилегированныйРежим(Истина);

	// Курьер, с которым заказ был связан раньше, мог освободиться.
	Если ЗначениеЗаполнено(мПредыдущийКурьер) И мПредыдущийКурьер <> Курьер Тогда
		ОсвободитьКурьера(мПредыдущийКурьер);
	КонецЕсли;

	Если ЗначениеЗаполнено(Курьер) Тогда
		Если Статус = Перечисления.СтатусыЗаказов.ПереданКурьеру Тогда
			ПометитьКурьераЗанятым(Курьер);
		Иначе
			ОсвободитьКурьера(Курьер);
		КонецЕсли;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Возвращает курьера, записанного в заказе до текущей записи.
Функция ПолучитьКурьераИзБазы()

	Если Ссылка.Пустая() Тогда
		Возврат Справочники.Курьеры.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Заказ.Курьер КАК Курьер
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|ГДЕ
	|	Заказ.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Курьер;
	КонецЕсли;

	Возврат Справочники.Курьеры.ПустаяСсылка();

КонецФункции

Процедура ПересчитатьСуммы()

	Для Каждого СтрокаСостава Из Состав Цикл
		СтрокаСостава.Сумма = Окр(СтрокаСостава.Количество * СтрокаСостава.Цена, 2);
	КонецЦикла;

	СуммаДокумента = Окр(Состав.Итог("Сумма"), 2);

КонецПроцедуры

Процедура ПроверитьСостав(Отказ)

	Если Состав.Количество() = 0 Тогда
		Сообщить("В заказе не указано ни одного блюда.", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаСостава Из Состав Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаСостава.Блюдо) Тогда
			Продолжить;
		КонецЕсли;

		// Заказ формируется только из блюд одного ресторана.
		Если ЗначениеЗаполнено(Ресторан) И СтрокаСостава.Блюдо.Ресторан <> Ресторан Тогда
			Сообщить("Блюдо """ + Строка(СтрокаСостава.Блюдо) + """ не относится к ресторану """
				+ Строка(Ресторан) + """. В заказ можно добавлять блюда только одного ресторана.",
				СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		Если СтрокаСостава.Количество <= 0 Тогда
			Сообщить("Количество блюда """ + Строка(СтрокаСостава.Блюдо) + """ должно быть больше нуля.",
				СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьКурьера(Отказ)

	// Проверяем только при назначении нового курьера, чтобы не блокировать
	// завершение уже выполняемых заказов.
	Если ЗначениеЗаполнено(Курьер) И Курьер <> мПредыдущийКурьер
		И Курьер.ТекущийСтатус = Перечисления.СтатусыКурьеров.НеНаСмене Тогда

		Сообщить("Курьер """ + Строка(Курьер) + """ сейчас не на смене. Выберите другого курьера.",
			СтатусСообщения.Важное);
		Отказ = Истина;

	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьМинимальнуюСумму()

	Если НЕ ЗначениеЗаполнено(Ресторан) Тогда
		Возврат;
	КонецЕсли;

	Если СуммаДокумента < Ресторан.МинимальнаяСуммаЗаказа Тогда
		Сообщить("Внимание: сумма заказа меньше минимальной суммы для ресторана!", СтатусСообщения.Внимание);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьФактическоеВремяДоставки()

	Если Статус <> Перечисления.СтатусыЗаказов.Доставлен Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ФактическоеВремяДоставки) Тогда
		ФактическоеВремяДоставки = ТекущаяДатаСеанса();
	КонецЕсли;

	ВремяДоставкиМинут = Макс(0, Окр((ФактическоеВремяДоставки - ДатаСоздания) / 60, 0));

КонецПроцедуры

// Переводит курьера в статус Занят, если он был Свободен.
Процедура ПометитьКурьераЗанятым(ТекущийКурьер)

	Если ТекущийКурьер.ТекущийСтатус <> Перечисления.СтатусыКурьеров.Свободен Тогда
		Возврат;
	КонецЕсли;

	ЗаблокироватьКурьера(ТекущийКурьер);

	ОбъектКурьера = ТекущийКурьер.ПолучитьОбъект();
	ОбъектКурьера.ТекущийСтатус = Перечисления.СтатусыКурьеров.Занят;
	ОбъектКурьера.Записать();

КонецПроцедуры

// Освобождает курьера, если у него не осталось заказов в статусе Передан курьеру.
Процедура ОсвободитьКурьера(ТекущийКурьер)

	Если ЕстьЗаказыКурьераВРаботе(ТекущийКурьер) Тогда
		Возврат;
	КонецЕсли;

	ЗаблокироватьКурьера(ТекущийКурьер);

	ОбъектКурьера = ТекущийКурьер.ПолучитьОбъект();
	Если ОбъектКурьера.ТекущийСтатус = Перечисления.СтатусыКурьеров.Занят Тогда
		ОбъектКурьера.ТекущийСтатус = Перечисления.СтатусыКурьеров.Свободен;
		ОбъектКурьера.Записать();
	КонецЕсли;

КонецПроцедуры

Функция ЕстьЗаказыКурьераВРаботе(ТекущийКурьер)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Заказ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|ГДЕ
	|	Заказ.Курьер = &Курьер
	|	И Заказ.Статус = &Статус";
	Запрос.УстановитьПараметр("Курьер", ТекущийКурьер);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказов.ПереданКурьеру);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

Процедура ЗаблокироватьКурьера(ТекущийКурьер)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Курьеры");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ТекущийКурьер);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();

КонецПроцедуры
